title: PowerShell Process Creation Keywords
id: d76a74b1-e2c8-4a92-b437-02b4d96a74b1
status: experimental
description: Detects suspicious PowerShell process creation using keywords.
author: Andrea Santagati @AndreSantagati
date: 2024/06/18
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - 'powershell.exe'
            - 'pwsh.exe'
    condition: selection
tags:
    - attack.execution
    - attack.t1059.001
level: medium